Tekla.Structures.Model.History.ModelHistory
The ModelHistory class provides history information about the objects of the model
that is currently open in Tekla Structures.
using Tekla.Structures.Model;
using Tekla.Structures.Model.History;
using System;
using System.Diagnostics;
using Tekla.Structures.Geometry3d;
public class Example1
{
/// to be called before modifications
private void Init()
{
ModelHistory.TakeModifications("Example1_ModStamp");
}
/// to be called when need to handle modifications
private void Run_TakeModifications()
{
var Modifications = ModelHistory.TakeModifications("Example1_ModStamp");
while (Modifications.Modified.MoveNext())
{
ModelObject mo = Modifications.Modified.Current;
Console.WriteLine("Run_TakeModifications: Modified id: {0}", mo.Identifier.GUID);
}
}
/// to be called when need to preview modifications without advancing modstamp
private void Run_GetModifications()
{
var Modifications = ModelHistory.GetModifications("Example1_ModStamp");
while (Modifications.Modified.MoveNext())
{
ModelObject mo = Modifications.Modified.Current;
Console.WriteLine("Run_GetModifications: Modified id: {0}", mo.Identifier.GUID);
}
}
/// this takes each modification only once
public void ModificationProcessed()
{
this.Init();
new Beam(new Point(), new Point(0, 0, 1000))
{
Name = "BEAM1",
Profile = new Profile() { ProfileString = "HEA400" },
Material = new Material() { MaterialString = "Steel_Undefined" }
}.Insert();
new Model().CommitChanges();
this.Run_TakeModifications(); // prints BEAM1
new Beam(new Point(), new Point(0, 0, 1000))
{
Name = "BEAM2",
Profile = new Profile() { ProfileString = "HEA400" },
Material = new Material() { MaterialString = "Steel_Undefined" }
}.Insert();
new Model().CommitChanges();
this.Run_TakeModifications(); // prints BEAM2, but not BEAM1
}
/// this always returns all modifications since last TakeModifications()
public void ModificationPreviewed()
{
this.Init();
new Beam(new Point(), new Point(0, 0, 1000))
{
Name = "BEAM1",
Profile = new Profile() { ProfileString = "HEA400" },
Material = new Material() { MaterialString = "Steel_Undefined" }
}.Insert();
new Model().CommitChanges();
this.Run_GetModifications(); // prints BEAM1
new Beam(new Point(), new Point(0, 0, 1000))
{
Name = "BEAM2",
Profile = new Profile() { ProfileString = "HEA400" },
Material = new Material() { MaterialString = "Steel_Undefined" }
}.Insert();
new Model().CommitChanges();
this.Run_GetModifications(); // prints both BEAM1 and BEAM2
}
}

Tekla.Structures.Model.History.ModelHistory.GetModifiedObjects(Tekla.Structures.Model.History.ModificationStamp)
Gets a list of the objects that have been added or modified after the modification stamp.
ModStamp: The modification stamp.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetModifiedObjectsWithType(Tekla.Structures.Model.History.ModificationStamp,Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Gets based on type a list of the objects that have been added or modified after the modification stamp.
ModStamp: The modification stamp.
Enum: The type of the objects to return.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetDeletedObjects(Tekla.Structures.Model.History.ModificationStamp)
Gets a list of the objects that have been deleted after the modification stamp.
ModStamp: The modification stamp.
Returns: A list of the objects that have been deleted after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetDeletedObjectsWithType(Tekla.Structures.Model.History.ModificationStamp,Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Gets based on type a list of the objects that have been deleted after the modification stamp.
ModStamp: The modification stamp.
Enum: The type of the objects to return.
Returns: A list of the objects that have been deleted after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetCurrentModificationStamp
Gets the current modification stamp from the model.
Returns: The current modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetCurrentModificationStampGuid
Gets the current modification stamp from the model, in form of Guid
It properly handles also models which use Runtime Id's.
Returns: The current modification stamp

Tekla.Structures.Model.History.ModelHistory.GetModifiedObjects(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum})
Gets a list of the objects that have been added or modified after the modification stamp.
ModStamp: The modification stamp, in string format. This may be Guid or encoded in case of static model ids.
ObjectTypes: Types of object to select. Empty or null selects all types.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetAttributeModifiedObjects(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum})
Gets a list of the objects that attributes (UDA) have been modified after the modification stamp.
ModStamp: The modification stamp, in string format. This may be Guid or encoded in case of static model ids.
ObjectTypes: Types of object to select. Empty or null selects all types.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetNumberingModifiedObjects(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum})
Gets a list of the objects that nubmering has been modified after the modification stamp.
ModStamp: The modification stamp, in string format. This may be Guid or encoded in case of static model ids.
ObjectTypes: Types of object to select. Empty or null selects all types.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetPhaseModifiedObjects(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum})
Gets a list of the objects that phase has been modified after the modification stamp.
ModStamp: The modification stamp, in string format. This may be Guid or encoded in case of static model ids.
ObjectTypes: Types of object to select. Empty or null selects all types.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetObjectsWithAnyModifications(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum})
Gets a list of the objects that have any modifications mande after the modification stamp.
ModStamp: The modification stamp, in string format. This may be Guid or encoded in case of static model ids.
ObjectTypes: Types of object to select. Empty or null selects all types.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetModifiedObjectsWithType(System.String,Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Gets based on type a list of the objects that have been added or modified after the modification stamp.
ModStamp: The modification stamp, in string format. This may be Guid or encoded in case of static model ids.
Enum: The type of the objects to return.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetDeletedObjects(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},System.Boolean)
Gets a list of the objects that have been deleted after the modification stamp.
ModStamp: The modification stamp, as returned by GetCurrentModificationStampGuid().
ObjectTypes: Types of object to select. Empty or null selects all types.
returnAlsoIfObjectIsCreatedAndDeletedAfterEvent: if set to true returns also the objects that are both created and deleted after event.
Returns:
A list of the objects that have been deleted after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetModifiedAndNumberedObjectsByFilterName(System.String,System.String,Tekla.Structures.Model.History.ModificationStamp)
Gets the objects which are new, modified or numbered after the modification stamp.
Name: The name.
FilterName: Name of the filter.
PrevStamp: The previous stamp.
Returns:
The new, modified or numbered objects passing the filter.

Tekla.Structures.Model.History.ModelHistory.GetModificationsByFilter(System.String,System.String)
Gets the objects which are new, modified or numbered after the modification stamp.
ModStamp: The modification stamp (guid).
FilterName: Name of the filter.
Returns:
The new, modified or numbered objects passing the filter.

Tekla.Structures.Model.History.ModelHistory.GetNotSharedObjects
Get object which are was created or modified since last ModelSharing WriteOut.
Remarks: If the model is not shared, returns all objects.
Returns: A list of objects

Tekla.Structures.Model.History.ModelHistory.GetLocalChanges
Get changes which are not written out.
Returns: Modifications which are not written out.

Tekla.Structures.Model.History.ModelHistory.TakeModifications(System.String,Tekla.Structures.Model.History.ModificationStamp)
Take modifications since previous call.
Remarks: Takes modification which has happened to the model since the previous call to TakeModifications with the same Name argument.
If there was no previous call with this Name, shows modifications since beginning, or since PrevStap, if it is specified.
Updates internal reference for use when TakeModifications() is called next time.
Name: Name of reference which is used for collecting modifications and which is updated.
Intended use is to assign an unique name for each client application which needs to be informed of the model updates.
Maximum length is 79 characters.
PrevStamp: When specified, default value of reference if is it not found
Returns: All modifications which happened since the last call. See ModificationInfo reference

Tekla.Structures.Model.History.ModelHistory.TakeModifications(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},Tekla.Structures.Model.History.ModificationStamp)
Take modifications since previous call, with object type filtering.
Remarks: Same as Tekla.Structures.Model.History.ModelHistory.TakeModifications(System.String,Tekla.Structures.Model.History.ModificationStamp), but returns only the types listed in ObjectTypes.
Note that since this function also sets base for the next invocation of TakeModifications() for ALL objects,
so using it discards change information for filtered objects.
Name: Name of reference which is used for collecting modifications and which is updated.
Intended use is to assign an unique name for each client application which needs to be informed of the model updates.
Maximum length is 79 characters.
ObjectTypes: Types of object to select. Empty or null selects all types.
PrevStamp: When specified, default value of reference if is it not found
Returns: All modifications which happened since the last call. See ModificationInfo reference

Tekla.Structures.Model.History.ModelHistory.UpdateModificationStampToLatest(System.String)
Updates the modification stamp to latest.
modificationStampKey: The modification stamp key.

Tekla.Structures.Model.History.ModelHistory.GetModifications(System.String,Tekla.Structures.Model.History.ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp
Remarks: Takes modification which has happened to the model since the previous call to TakeModifications with the same Name argument.
If there was no previous call of TakeModifications() with this Name, shows modifications since beginning, or since PrevStap, if it is specified.
Name: Name of reference which is used for collecting modifications and which is updated.
Intended use is to assign an unique name for each client application which needs to be informed of the model updates.
Maximum length is 79 characters.
PrevStamp: When specified, default value of reference if is it not found
Returns: All modifications which happened since the last call

Tekla.Structures.Model.History.ModelHistory.GetModifications(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},Tekla.Structures.Model.History.ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp, with object type filtering
Remarks: Same as Tekla.Structures.Model.History.ModelHistory.GetModifications(System.String,Tekla.Structures.Model.History.ModificationStamp), but returns only the types listed in ObjectTypes.
Name: Name of reference which is used for collecting modifications and which is updated.
Intended use is to assign an unique name for each client application which needs to be informed of the model updates.
Maximum length is 79 characters.
ObjectTypes: Types of object to select. Empty or null selects all types.
PrevStamp: When specified, default value of reference if is it not found
Returns: All modifications which happened since the last call

Tekla.Structures.Model.History.ModelHistory.GetModificationInfo(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},System.Boolean)
Get modifications.
modStamp: The mod stamp (guid).
ObjectTypes: Types of object to select. Empty or null selects all types.
returnAlsoIfObjectIsCreatedAndDeletedAfterEvent: if set to true returns object deleted also if object is created and deleted after event.
Returns:
The modifications.

Tekla.Structures.Model.History.ModelHistory.CheckModelOptionsModified(System.String)
Check if model options have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if model options have been modified.

Tekla.Structures.Model.History.ModelHistory.CheckDrawingOptionsModified(System.String)
Check if drawing options have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if drawing options have been modified.

Tekla.Structures.Model.History.ModelHistory.CheckMaterialDefinitionsModified(System.String)
Check if material definitions have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if material definitions have been modified.

Tekla.Structures.Model.History.ModelHistory.CheckProfileDefinitionsModified(System.String)
Check if profile definitions have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if profile definitions have been modified.

Tekla.Structures.Model.History.ModelHistory.CheckCustomPropertiesModifiedAfterStamp(System.String)
Checks if any of the custom properties plugins are changed after stamp.
ModStamp: The mod stamp.
Returns: true if custom property plugins are modified, otherwise false.

Tekla.Structures.Model.History.ModelHistory.CheckBoltDefinitionsModified(System.String)
Check if bolt definitions have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if bolt definitions have been modified.

Tekla.Structures.Model.History.ModelHistory.CheckBoltAssemblyDefinitionsModified(System.String)
Check if bolt assembly definitions have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if bolt assembly definitions have been modified.

Tekla.Structures.Model.History.ModelHistory.CheckDrawingsModified(System.String)
Checks if any of the drawings are created, modified or deleted after stamp.
ModStamp: The mod stamp.
Returns: true if any drawings have been modified.

Tekla.Structures.Model.History.ModelHistory.CheckObjectModifiedAfterStamp(System.Guid,System.String)
Check if object has been modified after modification stamp.
ObjectGuid: The object unique identifier.
ModStamp: The mod stamp.
Returns: True if object has been modified after modification stamp.